NAV_DATE
PORTFOLIO
MANAGEMENT_COMPANY
ASSET
ISIN
ДУ «ТКБ Инвестмент Партнерс» 18-226-РЖ
Собственные средства СК РЖ (ГПБ_Г000-Б-28180)
ДУ «ТКБ Инвестмент Партнерс» 18-230-РЖ
ДУ «ТКБ Инвестмент Партнерс» 21-229-РЖ
ДУ «Спутник-УК» 190221/1 SPURZ 10
ДУ «Спутник-УК» 271210/2 SPURZ
ДУ «Спутник-УК» 020611/2 SPURZ 2
ДУ «Спутник-УК» 260716/1 SPURZ 5
ДУ «Спутник-УК» 020611/3 SPURZ 3
ДУ «Спутник-УК» 050925/1 SPURZ 15
Собственные средства СК РЖ (ГПБ_Г000-Б-50817)
Собственные средства СК РЖ (ГПБ_Г000-Б-514660)
ДУ "УК Первая"_УК-11/2026
ДУ «Спутник-УК» 020611/1 SPURZ 1
ДУ «ТКБ Инвестмент Партнерс» 21-228-РЖ
Собственные средства СК РЖ REZHS
ДУ «Спутник-УК» 220223/2 SPURZ 14
ДУ «Райффайзен УК» 256-03.1ДУ/24
ДУ «Райффайзен УК» 257-03.1ДУ/24
ДУ «ТКБ Инвестмент Партнерс» 18-225-РЖ
ДУ «Спутник-УК» 081121/1 SPURZ 11
ДУ «Спутник-УК» 081121/2 SPURZ 12

ТКБ ИНВЕСТМЕНТ ПАРТНЕРС (АО)
ООО СК РЕНЕССАНС ЖИЗНЬ 
УК СПУТНИК - УПРАВЛЕНИЕ КАПИТАЛОМ АО
ПЕРВАЯ АО УК
УК РАЙФФАЙЗЕН ООО
